Repository: ProALgebra/MarketSimulateInterface-MSI-
Catalog: bot/locales/*/LC_MESSAGES/mybot.po
Languages: ru

# NO_HISTORY
source: It seems you haven't tested any strategies yet🙄
ru: Кажется вы еще не протестировали ни одной стратегии🙄

# ask_for_language
source: What language do you prefer?
ru: Какой язык вы предпочитаете?

# language_set
source: Your language has been changed.
ru: Ваш язык был изменен.

# READ_NAME
source: Enter a new username.
ru: Введите новое имя пользователя.

# new_name_accepted {first_name}
source: New user name: {}
ru: Новое имя пользователя: {}

# CANCEL_MESSAGE
source: Status reset😉
ru: Состояние сброшено😉

# START_CORE_MESSAGE
source: To test your algorithm, select the beginning of the data interval:
ru: Для тестирования вашего алгоритма выберите начало промежутка данных:

# END_DATA_CORE
source: Now select the end of the data span:
ru: Теперь выберите конец промежутка данных:

# COMMISSION
source: Enter the commission:
ru: Введите коммиссию:

# INVALID_COMMISION
source: Invalid data☹️, enter valid data.
ru: Неверные данные☹️, введиет валидные данные.

# START_CASH
source: Enter the initial capital💰✨
ru: Введите начальный капитал💰✨

# INVALID_SOURCE
source: This is not an archive!🤖🔄
ru: Это не архив!🤖🔄

# SOURCE
source: Send a zip archive with your strategy
ru: Отправьте zip-архив с вашей стратегией

# GPT_ERROR
source: I'm sorry, there was an error in processing the request.🚨
ru: Прошу прощения, возникла ошибка в обработке запроса.🚨

# START_MESSAGE
source: Registrations
ru: Регистрация

# task_infi
source: Task: {} : {} : {}
ru: Задача: {} {} {}

# keep_name
source: Write down the telegram username.
ru: Записать имя пользователя telegram.

# await_response_massage
source: Expect me to work on your request. Thank you for your patience!⏳
ru: Ожидайте, я работаю над вашим запросом. Спасибо за терпение!⏳

# REGISTRATIONS_MESSAGE
source: To get started with our service, please register.
ru: Для начала работы с нашим сервисом, пожалуйста, зарегистрируйтесь.

# THROTTLED_MESSAGE
source: User data📊
ru: Внимание! Обнаружено большое количество сообщений за короткий промежуток времени. Это может привести к перегрузке системы

# core_commisions
source: 😉Commission
ru: 😉Комиссия

# core_cash
source: 📊Deposit
ru: 📊Депозит

# core_source
source: 💰Strategy
ru: 💰Стратегия

# CHOISE
source: 🤖What do you want to fill out next?
ru: 🤖Что желаете заполнить дальше?

# result
source: Even oracles can't see that far😉... Choose a date not from the future
ru: Данные пользователя:😉{} : ✨{} : 🤖{}

# INVALIDE_START_MESSAGE
source: Your date made even ChatGPT think😥... Choose a date not from the future
ru: Ваша дата заставила задуматься даже ChatGPT😥... Выберите дату не из будущего

# INVALIDE_END_MESSAGE
source: And what is it? The start date must be less than the end date...
ru: И что это такое? Дата начала должна быть меньше даты конца...

# get_history
source: Get request history📜
ru: Получить историю запросов📜

# change_name
source: Change user name🔄
ru: Сменить имя пользователя🔄

# change_language
source: Change the language🌐
ru: Сменить язык🌐

# core_start
source: Test the algorithm🧪
ru: Протестировать алгоритм🧪
